; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	spectrograph3 - mode
	infrared2 - mode
	infrared5 - mode
	thermograph1 - mode
	spectrograph4 - mode
	thermograph0 - mode
	Star1 - direction
	Star5 - direction
	GroundStation0 - direction
	Star2 - direction
	Star4 - direction
	Star3 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared5)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star4)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument3 infrared5)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 infrared2)
	(supports instrument4 thermograph1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star4)
	(supports instrument5 infrared5)
	(supports instrument5 spectrograph4)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 Star3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
)
(:goal (and
	(pointing satellite0 Star4)
	(have_image Planet6 thermograph1)
	(have_image Planet6 thermograph0)
	(have_image Phenomenon7 infrared2)
	(have_image Star8 thermograph0)
	(have_image Star9 spectrograph4)
	(have_image Phenomenon10 thermograph0)
	(have_image Phenomenon10 infrared2)
	(have_image Phenomenon11 spectrograph4)
	(have_image Phenomenon12 spectrograph4)
))

)

; plan
1. (turn_to satellite1 star4 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star4)
   goals met: 0 of 10
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 10
3. (calibrate satellite1 instrument4 star4)
   added: (calibrated instrument4)
   goals met: 0 of 10
4. (turn_to satellite1 phenomenon7 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon7)
   goals met: 0 of 10
5. (take_image satellite1 phenomenon7 instrument4 infrared2)
   added: (have_image phenomenon7 infrared2)
   goals met: 1 of 10
6. (turn_to satellite1 phenomenon10 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon10)
   goals met: 1 of 10
7. (turn_to satellite0 star4 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star4)
   goals met: 2 of 10
8. (take_image satellite1 phenomenon10 instrument4 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 3 of 10
9. (take_image satellite1 phenomenon10 instrument4 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 4 of 10
10. (turn_to satellite1 planet6 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet6)
   goals met: 4 of 10
11. (take_image satellite1 planet6 instrument4 thermograph0)
   added: (have_image planet6 thermograph0)
   goals met: 5 of 10
12. (take_image satellite1 planet6 instrument4 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 6 of 10
13. (turn_to satellite1 star8 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star8)
   goals met: 6 of 10
14. (take_image satellite1 star8 instrument4 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 7 of 10
15. (switch_off instrument4 satellite1)
   deleted: (power_on instrument4)
   added: (power_avail satellite1)
   goals met: 7 of 10
16. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 7 of 10
17. (turn_to satellite1 star3 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star3)
   goals met: 7 of 10
18. (calibrate satellite1 instrument5 star3)
   added: (calibrated instrument5)
   goals met: 7 of 10
19. (turn_to satellite1 phenomenon11 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon11)
   goals met: 7 of 10
20. (take_image satellite1 phenomenon11 instrument5 spectrograph4)
   added: (have_image phenomenon11 spectrograph4)
   goals met: 8 of 10
21. (turn_to satellite1 phenomenon12 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon12)
   goals met: 8 of 10
22. (take_image satellite1 phenomenon12 instrument5 spectrograph4)
   added: (have_image phenomenon12 spectrograph4)
   goals met: 9 of 10
23. (turn_to satellite1 star9 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 star9)
   goals met: 9 of 10
24. (take_image satellite1 star9 instrument5 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 10 of 10
